balazsgrill/modembed/res/Devices/dsPIC33/PIC24EP512GU810.PIC
    </edc:UserIDSector>
  </edc:ProgramSpace>
  <edc:DataSpace edc:dmabeginaddr="0xD000" edc:xbeginaddr="0x1000" edc:xendaddr="0xE000">
    <edc:RegardlessOfMode>
      <edc:SFRDataSector edc:beginaddr="0x0" edc:endaddr="0x1000" edc:regionid="sfrs">
        <edc:Module_ref edc:begin="0x0" edc:end="0x22" edc:modsrc="DOS-00794.Module"/>
        <edc:AdjustPoint edc:offset="12"/>
        <edc:Module_ref edc:begin="0x2E" edc:end="0x38" edc:modsrc="DOS-00794.Module"/>
        <edc:AdjustPoint edc:offset="10"/>
        <edc:Module_ref edc:begin="0x42" edc:end="0x46" edc:modsrc="DOS-00794.Module">
          <edc:ModuleExclude edc:impl="0x1ff" edc:offset="0x42"/>
          <edc:ModuleExclude edc:impl="0x800c" edc:offset="0x44"/>
        </edc:Module_ref>
        <edc:AdjustPoint edc:offset="12"/>
        <edc:Module_ref edc:begin="0x52" edc:end="0x56" edc:modsrc="DOS-00794.Module"/>
        <edc:AdjustPoint edc:offset="2"/>
        <edc:Module_ref edc:begin="0x58" edc:end="0x5a" edc:modsrc="DOS-00794.Module"/>
        <edc:AdjustPoint edc:offset="166"/>
        <edc:Module_ref edc:begin="0x0" edc:end="0x6" edc:modsrc="DOS-00931.Module"/>
        <edc:Module_ref edc:begin="0x0" edc:end="0xe" edc:modsrc="DOS-00932.Module">
          <edc:ModuleMacro edc:replace="%x%" edc:with="2"/>
          <edc:ModuleMacro edc:replace="%y%" edc:with="3"/>
        </edc:Module_ref>
        <edc:Module_ref edc:begin="0x0" edc:end="0xe" edc:modsrc="DOS-00932.Module">
          <edc:ModuleMacro edc:replace="%x%" edc:with="4"/>
          <edc:ModuleMacro edc:replace="%y%" edc:with="5"/>
        </edc:Module_ref>
        <edc:Module_ref edc:begin="0x0" edc:end="0xe" edc:modsrc="DOS-00932.Module">
          <edc:ModuleMacro edc:replace="%x%" edc:with="6"/>
          <edc:ModuleMacro edc:replace="%y%" edc:with="7"/>
        </edc:Module_ref>
        <edc:Module_ref edc:begin="0x0" edc:end="0xe" edc:modsrc="DOS-00932.Module">
          <edc:ModuleMacro edc:replace="%x%" edc:with="8"/>
          <edc:ModuleMacro edc:replace="%y%" edc:with="9"/>
        </edc:Module_ref>
        <edc:AdjustPoint edc:offset="2"/>
        <edc:Module_ref edc:begin="0x0" edc:end="0x8" edc:modsrc="DOS-00942.Module">
          <edc:ModuleMacro edc:replace="@" edc:with="1"/>
        </edc:Module_ref>
        <edc:Module_ref edc:begin="0x0" edc:end="0x8" edc:modsrc="DOS-00942.Module">
          <edc:ModuleMacro edc:replace="@" edc:with="2"/>
        </edc:Module_ref>
        <edc:Module_ref edc:begin="0x0" edc:end="0x8" edc:modsrc="DOS-00942.Module">
          <edc:ModuleMacro edc:replace="@" edc:with="3"/>
        </edc:Module_ref>
        <edc:Module_ref edc:begin="0x0" edc:end="0x8" edc:modsrc="DOS-00942.Module">
          <edc:ModuleMacro edc:replace="@" edc:with="4"/>
        </edc:Module_ref>
        <edc:Module_ref edc:begin="0x0" edc:end="0x8" edc:modsrc="DOS-00942.Module">
          <edc:ModuleMacro edc:replace="@" edc:with="5"/>
        </edc:Module_ref>
        <edc:Module_ref edc:begin="0x0" edc:end="0x8" edc:modsrc="DOS-00942.Module">
          <edc:ModuleMacro edc:replace="@" edc:with="6"/>
        </edc:Module_ref>
        <edc:Module_ref edc:begin="0x0" edc:end="0x8" edc:modsrc="DOS-00942.Module">
          <edc:ModuleMacro edc:replace="@" edc:with="7"/>
        </edc:Module_ref>
        <edc:Module_ref edc:begin="0x0" edc:end="0x8" edc:modsrc="DOS-00942.Module">
          <edc:ModuleMacro edc:replace="@" edc:with="8"/>
        </edc:Module_ref>
        <edc:Module_ref edc:begin="0x0" edc:end="0x8" edc:modsrc="DOS-00942.Module">
          <edc:ModuleMacro edc:replace="@" edc:with="9"/>
        </edc:Module_ref>
        <edc:Module_ref edc:begin="0x0" edc:end="0x8" edc:modsrc="DOS-00942.Module">
          <edc:ModuleMacro edc:replace="@" edc:with="10"/>
        </edc:Module_ref>
        <edc:Module_ref edc:begin="0x0" edc:end="0x8" edc:modsrc="DOS-00942.Module">
          <edc:ModuleMacro edc:replace="@" edc:with="11"/>
        </edc:Module_ref>
        <edc:Module_ref edc:begin="0x0" edc:end="0x8" edc:modsrc="DOS-00942.Module">
          <edc:ModuleMacro edc:replace="@" edc:with="12"/>
        </edc:Module_ref>
        <edc:Module_ref edc:begin="0x0" edc:end="0x8" edc:modsrc="DOS-00942.Module">
          <edc:ModuleMacro edc:replace="@" edc:with="13"/>
        </edc:Module_ref>
        <edc:Module_ref edc:begin="0x0" edc:end="0x8" edc:modsrc="DOS-00942.Module">
          <edc:ModuleMacro edc:replace="@" edc:with="14"/>
        </edc:Module_ref>
        <edc:Module_ref edc:begin="0x0" edc:end="0x8" edc:modsrc="DOS-00942.Module">
          <edc:ModuleMacro edc:replace="@" edc:with="15"/>
        </edc:Module_ref>
        <edc:Module_ref edc:begin="0x0" edc:end="0x8" edc:modsrc="DOS-00942.Module">
          <edc:ModuleMacro edc:replace="@" edc:with="16"/>
        </edc:Module_ref>
        <edc:AdjustPoint edc:offset="64"/>
        <edc:Module_ref edc:begin="0x0" edc:end="0xe" edc:modsrc="DOS-00996.Module">
          <edc:ModuleMacro edc:replace="@" edc:with="1"/>
        </edc:Module_ref>
        <edc:AdjustPoint edc:offset="2"/>
        <edc:Module_ref edc:begin="0x0" edc:end="0xe" edc:modsrc="DOS-00996.Module">
          <edc:ModuleMacro edc:replace="@" edc:with="2"/>
        </edc:Module_ref>
        <edc:AdjustPoint edc:offset="2"/>
        <edc:Module_ref edc:begin="0x0" edc:end="0xa" edc:modsrc="DOS-00997.Module">
          <edc:ModuleMacro edc:replace="@" edc:with="1"/>
        </edc:Module_ref>
        <edc:AdjustPoint edc:offset="6"/>
        <edc:Module_ref edc:begin="0x0" edc:end="0xa" edc:modsrc="DOS-00997.Module">
          <edc:ModuleMacro edc:replace="@" edc:with="2"/>
        </edc:Module_ref>
        <edc:AdjustPoint edc:offset="6"/>
        <edc:Module_ref edc:begin="0x0" edc:end="0x6" edc:modsrc="DOS-00998.Module">
          <edc:ModuleMacro edc:replace="@" edc:with="1"/>
        </edc:Module_ref>
        <edc:AdjustPoint edc:offset="2"/>
        <edc:Module_ref edc:begin="0x8" edc:end="0xa" edc:modsrc="DOS-00998.Module">
          <edc:ModuleMacro edc:replace="@" edc:with="1"/>
        </edc:Module_ref>
        <edc:AdjustPoint edc:offset="6"/>
        <edc:Module_ref edc:begin="0x0" edc:end="0xa" edc:modsrc="DOS-00997.Module">
          <edc:ModuleMacro edc:replace="@" edc:with="3"/>
        </edc:Module_ref>
        <edc:AdjustPoint edc:offset="6"/>
        <edc:Module_ref edc:begin="0x0" edc:end="0x6" edc:modsrc="DOS-00998.Module">
          <edc:ModuleMacro edc:replace="@" edc:with="2"/>
        </edc:Module_ref>
        <edc:AdjustPoint edc:offset="2"/>
        <edc:Module_ref edc:begin="0x8" edc:end="0xa" edc:modsrc="DOS-00998.Module">
          <edc:ModuleMacro edc:replace="@" edc:with="2"/>
        </edc:Module_ref>
        <edc:AdjustPoint edc:offset="22"/>
        <edc:Module_ref edc:begin="0x0" edc:end="0xa" edc:modsrc="DOS-00209.Module"/>
        <edc:AdjustPoint edc:offset="2"/>
        <edc:Module_ref edc:begin="0xc" edc:end="0xe" edc:modsrc="DOS-00209.Module"/>
        <edc:AdjustPoint edc:offset="2"/>
        <edc:Module_ref edc:begin="0x10" edc:end="0x20" edc:modsrc="DOS-00209.Module"/>
        <edc:Module_ref edc:begin="0x0" edc:end="0x6" edc:modsrc="DOS-00998.Module">
          <edc:ModuleMacro edc:replace="@" edc:with="3"/>
        </edc:Module_ref>
        <edc:AdjustPoint edc:offset="2"/>
        <edc:Module_ref edc:begin="0x8" edc:end="0xa" edc:modsrc="DOS-00998.Module">
          <edc:ModuleMacro edc:replace="@" edc:with="3"/>
        </edc:Module_ref>
        <edc:AdjustPoint edc:offset="6"/>
        <edc:Module_ref edc:begin="0x0" edc:end="0xa" edc:modsrc="DOS-00997.Module">
          <edc:ModuleMacro edc:replace="@" edc:with="4"/>
        </edc:Module_ref>
        <edc:AdjustPoint edc:offset="6"/>
        <edc:Module_ref edc:begin="0x0" edc:end="0x6" edc:modsrc="DOS-00998.Module">
          <edc:ModuleMacro edc:replace="@" edc:with="4"/>
        </edc:Module_ref>
        <edc:AdjustPoint edc:offset="2"/>
        <edc:Module_ref edc:begin="0x8" edc:end="0xa" edc:modsrc="DOS-00998.Module">
          <edc:ModuleMacro edc:replace="@" edc:with="4"/>
        </edc:Module_ref>
        <edc:AdjustPoint edc:offset="54"/>
        <edc:Module_ref edc:begin="0x0" edc:end="0x2a" edc:modsrc="DOS-01041.Module">
          <edc:ModuleMacro edc:replace="@" edc:with="1"/>
        </edc:Module_ref>
        <edc:AdjustPoint edc:offset="4"/>
        <edc:Module_ref edc:begin="0x2e" edc:end="0x34" edc:modsrc="DOS-01041.Module">
          <edc:ModuleMacro edc:replace="@" edc:with="1"/>
        </edc:Module_ref>
        <edc:AdjustPoint edc:offset="12"/>
        <edc:Module_ref edc:begin="0x0" edc:end="0x2a" edc:modsrc="DOS-01041.Module">
          <edc:ModuleMacro edc:replace="@" edc:with="2"/>
          <edc:ModuleExclude edc:impl="0xfbff" edc:offset="0x20"/>
        </edc:Module_ref>
        <edc:AdjustPoint edc:offset="6"/>
        <edc:Module_ref edc:begin="0x30" edc:end="0x34" edc:modsrc="DOS-01041.Module">
          <edc:ModuleMacro edc:replace="@" edc:with="2"/>
        </edc:Module_ref>
        <edc:AdjustPoint edc:offset="140"/>
        <edc:Module_ref edc:begin="0x0" edc:end="0x16" edc:modsrc="DOS-01198.Module">
          <edc:ModuleMacro edc:replace="@" edc:with="1"/>
        </edc:Module_ref>
        <edc:AdjustPoint edc:offset="2"/>
        <edc:Module_ref edc:begin="0x18" edc:end="0x1c" edc:modsrc="DOS-01198.Module">
          <edc:ModuleMacro edc:replace="@" edc:with="1"/>
        </edc:Module_ref>
        <edc:AdjustPoint edc:offset="4"/>
        <edc:Module_ref edc:begin="0x20" edc:end="0x2c" edc:modsrc="DOS-01198.Module">
          <edc:ModuleMacro edc:replace="@" edc:with="1"/>
        </edc:Module_ref>
        <edc:AdjustPoint edc:offset="4"/>
        <edc:Module_ref edc:begin="0x30" edc:end="0x3c" edc:modsrc="DOS-01198.Module">
          <edc:ModuleMacro edc:replace="@" edc:with="1"/>
        </edc:Module_ref>
        <edc:AdjustPoint edc:offset="4"/>
        <edc:Module_ref edc:begin="0x40" edc:end="0x80" edc:modsrc="DOS-01198.Module">
          <edc:ModuleMacro edc:replace="@" edc:with="1"/>
        </edc:Module_ref>
        <edc:AdjustPoint edc:offset="8"/>
        <edc:Module_ref edc:begin="0x8" edc:end="0x12" edc:modsrc="DOS-01113.Module"/>
        <edc:AdjustPoint edc:offset="46"/>
        <edc:Module_ref edc:begin="0x40" edc:end="0x80" edc:modsrc="DOS-01113.Module"/>
        <edc:Module_ref edc:begin="0x0" edc:end="0x16" edc:modsrc="DOS-01198.Module">
          <edc:ModuleMacro edc:replace="@" edc:with="2"/>
        </edc:Module_ref>
        <edc:AdjustPoint edc:offset="2"/>
        <edc:Module_ref edc:begin="0x18" edc:end="0x1c" edc:modsrc="DOS-01198.Module">
          <edc:ModuleMacro edc:replace="@" edc:with="2"/>
        </edc:Module_ref>
        <edc:AdjustPoint edc:offset="4"/>
        <edc:Module_ref edc:begin="0x20" edc:end="0x2c" edc:modsrc="DOS-01198.Module">
          <edc:ModuleMacro edc:replace="@" edc:with="2"/>
        </edc:Module_ref>
        <edc:AdjustPoint edc:offset="4"/>
        <edc:Module_ref edc:begin="0x30" edc:end="0x3c" edc:modsrc="DOS-01198.Module">
          <edc:ModuleMacro edc:replace="@" edc:with="2"/>
        </edc:Module_ref>
        <edc:AdjustPoint edc:offset="4"/>
        <edc:Module_ref edc:begin="0x40" edc:end="0x80" edc:modsrc="DOS-01198.Module">
          <edc:ModuleMacro edc:replace="@" edc:with="2"/>
        </edc:Module_ref>
        <edc:Module_ref edc:begin="0x82" edc:end="0x86" edc:modsrc="DOS-01113.Module"/>
        <edc:AdjustPoint edc:offset="124"/>
        <edc:Module_ref edc:begin="0x0" edc:end="0x10" edc:modsrc="DOS-00999.Module"/>
        <edc:AdjustPoint edc:offset="16"/>
        <edc:Module_ref edc:begin="0x0" edc:end="0x8" edc:modsrc="DOS-00828.Module"/>
        <edc:AdjustPoint edc:offset="24"/>
        <edc:Module_ref edc:begin="0x0" edc:end="0x10" edc:modsrc="DOS-01116.Module"/>
        <edc:AdjustPoint edc:offset="48"/>
        <edc:Module_ref edc:begin="0x0" edc:end="0x2" edc:modsrc="DOS-01017-RPORx.Module">
          <edc:ModuleMacro edc:replace="@" edc:with="0"/>
          <edc:ModuleMacro edc:replace="%x%" edc:with="65"/>
          <edc:ModuleMacro edc:replace="%y%" edc:with="64"/>
        </edc:Module_ref>
        <edc:Module_ref edc:begin="0x0" edc:end="0x2" edc:modsrc="DOS-01017-RPORx.Module">
          <edc:ModuleMacro edc:replace="@" edc:with="1"/>
          <edc:ModuleMacro edc:replace="%x%" edc:with="67"/>
          <edc:ModuleMacro edc:replace="%y%" edc:with="66"/>
        </edc:Module_ref>
        <edc:Module_ref edc:begin="0x0" edc:end="0x2" edc:modsrc="DOS-01017-RPORx.Module">
          <edc:ModuleMacro edc:replace="@" edc:with="2"/>
          <edc:ModuleMacro edc:replace="%x%" edc:with="69"/>
          <edc:ModuleMacro edc:replace="%y%" edc:with="68"/>
        </edc:Module_ref>
        <edc:Module_ref edc:begin="0x0" edc:end="0x2" edc:modsrc="DOS-01017-RPORx.Module">
          <edc:ModuleMacro edc:replace="@" edc:with="3"/>
          <edc:ModuleMacro edc:replace="%x%" edc:with="71"/>
          <edc:ModuleMacro edc:replace="%y%" edc:with="70"/>
        </edc:Module_ref>
        <edc:Module_ref edc:begin="0x0" edc:end="0x2" edc:modsrc="DOS-01017-RPORx.Module">
          <edc:ModuleMacro edc:replace="@" edc:with="4"/>
          <edc:ModuleMacro edc:replace="%x%" edc:with="80"/>
          <edc:ModuleMacro edc:replace="%y%" edc:with="79"/>
        </edc:Module_ref>
        <edc:Module_ref edc:begin="0x0" edc:end="0x2" edc:modsrc="DOS-01017-RPORx.Module">
          <edc:ModuleMacro edc:replace="@" edc:with="5"/>
          <edc:ModuleMacro edc:replace="%x%" edc:with="84"/>
          <edc:ModuleMacro edc:replace="%y%" edc:with="82"/>
        </edc:Module_ref>
        <edc:Module_ref edc:begin="0x0" edc:end="0x2" edc:modsrc="DOS-01017-RPORx.Module">
          <edc:ModuleMacro edc:replace="@" edc:with="6"/>
          <edc:ModuleMacro edc:replace="%x%" edc:with="87"/>
          <edc:ModuleMacro edc:replace="%y%" edc:with="85"/>
        </edc:Module_ref>
        <edc:Module_ref edc:begin="0x0" edc:end="0x2" edc:modsrc="DOS-01017-RPORx.Module">
          <edc:ModuleMacro edc:replace="@" edc:with="7"/>
          <edc:ModuleMacro edc:replace="%x%" edc:with="97"/>
          <edc:ModuleMacro edc:replace="%y%" edc:with="96"/>
        </edc:Module_ref>
        <edc:Module_ref edc:begin="0x0" edc:end="0x2" edc:modsrc="DOS-01017-RPORx.Module">
          <edc:ModuleMacro edc:replace="@" edc:with="8"/>
          <edc:ModuleMacro edc:replace="%x%" edc:with="99"/>
          <edc:ModuleMacro edc:replace="%y%" edc:with="98"/>
        </edc:Module_ref>
        <edc:Module_ref edc:begin="0x0" edc:end="0x2" edc:modsrc="DOS-01017-RPORx.Module">
          <edc:ModuleMacro edc:replace="@" edc:with="9"/>
          <edc:ModuleMacro edc:replace="%x%" edc:with="101"/>
          <edc:ModuleMacro edc:replace="%y%" edc:with="100"/>
        </edc:Module_ref>
        <edc:AdjustPoint edc:offset="2"/>
        <edc:Module_ref edc:begin="0x0" edc:end="0x2" edc:modsrc="DOS-01017-RPORx.Module">
          <edc:ModuleMacro edc:replace="@" edc:with="11"/>
          <edc:ModuleMacro edc:replace="%x%" edc:with="108"/>
          <edc:ModuleMacro edc:replace="%y%" edc:with="104"/>
        </edc:Module_ref>
        <edc:Module_ref edc:begin="0x0" edc:end="0x2" edc:modsrc="DOS-01017-RPORx.Module">
          <edc:ModuleMacro edc:replace="@" edc:with="12"/>
          <edc:ModuleMacro edc:replace="%x%" edc:with="112"/>
          <edc:ModuleMacro edc:replace="%y%" edc:with="109"/>
        </edc:Module_ref>
        <edc:Module_ref edc:begin="0x0" edc:end="0x2" edc:modsrc="DOS-01017-RPORx.Module">
          <edc:ModuleMacro edc:replace="@" edc:with="13"/>
          <edc:ModuleMacro edc:replace="%x%" edc:with="118"/>
          <edc:ModuleMacro edc:replace="%y%" edc:with="113"/>
        </edc:Module_ref>
        <edc:Module_ref edc:begin="0x0" edc:end="0x2" edc:modsrc="DOS-01017-RPORx.Module">
          <edc:ModuleMacro edc:replace="@" edc:with="14"/>
          <edc:ModuleMacro edc:replace="%x%" edc:with="125"/>
          <edc:ModuleMacro edc:replace="%y%" edc:with="120"/>
        </edc:Module_ref>
        <edc:Module_ref edc:begin="0x0" edc:end="0x2" edc:modsrc="DOS-01017-RPORx.Module">
          <edc:ModuleMacro edc:replace="@" edc:with="15"/>
          <edc:ModuleMacro edc:replace="%x%" edc:with="127"/>
          <edc:ModuleMacro edc:replace="%y%" edc:with="126"/>
        </edc:Module_ref>
        <edc:Module_ref edc:begin="0x0" edc:end="0x2" edc:modsrc="DOS-01017-RPINRx.Module">
          <edc:ModuleMacro edc:replace="@" edc:with="0"/>
          <edc:ModuleMacro edc:replace="%x%" edc:with="INT1"/>
          <edc:ModuleMacro edc:replace="%y%" edc:with="RSV"/>
          <edc:ModuleExclude edc:impl="0xff80" edc:offset="0x0"/>
        </edc:Module_ref>
        <edc:Module_ref edc:begin="0x0" edc:end="0x2" edc:modsrc="DOS-01017-RPINRx.Module">
          <edc:ModuleMacro edc:replace="@" edc:with="1"/>
          <edc:ModuleMacro edc:replace="%x%" edc:with="INT3"/>
          <edc:ModuleMacro edc:replace="%y%" edc:with="INT2"/>
        </edc:Module_ref>
        <edc:Module_ref edc:begin="0x0" edc:end="0x2" edc:modsrc="DOS-01017-RPINRx.Module">
          <edc:ModuleMacro edc:replace="@" edc:with="2"/>
          <edc:ModuleMacro edc:replace="%x%" edc:with="RSV"/>
          <edc:ModuleMacro edc:replace="%y%" edc:with="INT4"/>
        </edc:Module_ref>
        <edc:Module_ref edc:begin="0x0" edc:end="0x2" edc:modsrc="DOS-01017-RPINRx.Module">
          <edc:ModuleMacro edc:replace="@" edc:with="3"/>
          <edc:ModuleMacro edc:replace="%x%" edc:with="T3CK"/>
          <edc:ModuleMacro edc:replace="%y%" edc:with="T2CK"/>
        </edc:Module_ref>
        <edc:Module_ref edc:begin="0x0" edc:end="0x2" edc:modsrc="DOS-01017-RPINRx.Module">
          <edc:ModuleMacro edc:replace="@" edc:with="4"/>
          <edc:ModuleMacro edc:replace="%x%" edc:with="T5CK"/>
          <edc:ModuleMacro edc:replace="%y%" edc:with="T4CK"/>
        </edc:Module_ref>
        <edc:Module_ref edc:begin="0x0" edc:end="0x2" edc:modsrc="DOS-01017-RPINRx.Module">
          <edc:ModuleMacro edc:replace="@" edc:with="5"/>
          <edc:ModuleMacro edc:replace="%x%" edc:with="T7CK"/>
          <edc:ModuleMacro edc:replace="%y%" edc:with="T6CK"/>
        </edc:Module_ref>
        <edc:Module_ref edc:begin="0x0" edc:end="0x2" edc:modsrc="DOS-01017-RPINRx.Module">
          <edc:ModuleMacro edc:replace="@" edc:with="6"/>
          <edc:ModuleMacro edc:replace="%x%" edc:with="T9CK"/>
          <edc:ModuleMacro edc:replace="%y%" edc:with="T8CK"/>
        </edc:Module_ref>
        <edc:Module_ref edc:begin="0x0" edc:end="0x2" edc:modsrc="DOS-01017-RPINRx.Module">
          <edc:ModuleMacro edc:replace="@" edc:with="7"/>
          <edc:ModuleMacro edc:replace="%x%" edc:with="IC2"/>
          <edc:ModuleMacro edc:replace="%y%" edc:with="IC1"/>
        </edc:Module_ref>
        <edc:Module_ref edc:begin="0x0" edc:end="0x2" edc:modsrc="DOS-01017-RPINRx.Module">
          <edc:ModuleMacro edc:replace="@" edc:with="8"/>
          <edc:ModuleMacro edc:replace="%x%" edc:with="IC4"/>
          <edc:ModuleMacro edc:replace="%y%" edc:with="IC3"/>
        </edc:Module_ref>
        <edc:Module_ref edc:begin="0x0" edc:end="0x2" edc:modsrc="DOS-01017-RPINRx.Module">
          <edc:ModuleMacro edc:replace="@" edc:with="9"/>
          <edc:ModuleMacro edc:replace="%x%" edc:with="IC6"/>
          <edc:ModuleMacro edc:replace="%y%" edc:with="IC5"/>
        </edc:Module_ref>
        <edc:Module_ref edc:begin="0x0" edc:end="0x2" edc:modsrc="DOS-01017-RPINRx.Module">
          <edc:ModuleMacro edc:replace="@" edc:with="10"/>
          <edc:ModuleMacro edc:replace="%x%" edc:with="IC8"/>
          <edc:ModuleMacro edc:replace="%y%" edc:with="IC7"/>
        </edc:Module_ref>
        <edc:Module_ref edc:begin="0x0" edc:end="0x2" edc:modsrc="DOS-01017-RPINRx.Module">
          <edc:ModuleMacro edc:replace="@" edc:with="11"/>
          <edc:ModuleMacro edc:replace="%x%" edc:with="OCFB"/>
          <edc:ModuleMacro edc:replace="%y%" edc:with="OCFA"/>
        </edc:Module_ref>
        <edc:Module_ref edc:begin="0x0" edc:end="0x2" edc:modsrc="DOS-01017-RPINRx.Module">
          <edc:ModuleMacro edc:replace="@" edc:with="12"/>
          <edc:ModuleMacro edc:replace="%x%" edc:with="FLT2"/>
          <edc:ModuleMacro edc:replace="%y%" edc:with="FLT1"/>
        </edc:Module_ref>
        <edc:Module_ref edc:begin="0x0" edc:end="0x2" edc:modsrc="DOS-01017-RPINRx.Module">
          <edc:ModuleMacro edc:replace="@" edc:with="13"/>
          <edc:ModuleMacro edc:replace="%x%" edc:with="FLT4"/>
          <edc:ModuleMacro edc:replace="%y%" edc:with="FLT3"/>
        </edc:Module_ref>
        <edc:Module_ref edc:begin="0x0" edc:end="0x2" edc:modsrc="DOS-01017-RPINRx.Module">
          <edc:ModuleMacro edc:replace="@" edc:with="14"/>
          <edc:ModuleMacro edc:replace="%x%" edc:with="QEB1"/>
          <edc:ModuleMacro edc:replace="%y%" edc:with="QEA1"/>
        </edc:Module_ref>
        <edc:Module_ref edc:begin="0x0" edc:end="0x2" edc:modsrc="DOS-01017-RPINRx.Module">
          <edc:ModuleMacro edc:replace="@" edc:with="15"/>
          <edc:ModuleMacro edc:replace="%x%" edc:with="HOME1"/>
          <edc:ModuleMacro edc:replace="%y%" edc:with="INDX1"/>
        </edc:Module_ref>
        <edc:Module_ref edc:begin="0x0" edc:end="0x2" edc:modsrc="DOS-01017-RPINRx.Module">
          <edc:ModuleMacro edc:replace="@" edc:with="16"/>
          <edc:ModuleMacro edc:replace="%x%" edc:with="QEB2"/>
          <edc:ModuleMacro edc:replace="%y%" edc:with="QEA2"/>
        </edc:Module_ref>
        <edc:Module_ref edc:begin="0x0" edc:end="0x2" edc:modsrc="DOS-01017-RPINRx.Module">
          <edc:ModuleMacro edc:replace="@" edc:with="17"/>
          <edc:ModuleMacro edc:replace="%x%" edc:with="HOME2"/>
          <edc:ModuleMacro edc:replace="%y%" edc:with="INDX2"/>
        </edc:Module_ref>
        <edc:Module_ref edc:begin="0x0" edc:end="0x2" edc:modsrc="DOS-01017-RPINRx.Module">
          <edc:ModuleMacro edc:replace="@" edc:with="18"/>
          <edc:ModuleMacro edc:replace="%x%" edc:with="U1CTS"/>
          <edc:ModuleMacro edc:replace="%y%" edc:with="U1RX"/>
        </edc:Module_ref>
        <edc:Module_ref edc:begin="0x0" edc:end="0x2" edc:modsrc="DOS-01017-RPINRx.Module">
          <edc:ModuleMacro edc:replace="@" edc:with="19"/>
          <edc:ModuleMacro edc:replace="%x%" edc:with="U2CTS"/>
          <edc:ModuleMacro edc:replace="%y%" edc:with="U2RX"/>
        </edc:Module_ref>
        <edc:Module_ref edc:begin="0x0" edc:end="0x2" edc:modsrc="DOS-01017-RPINRx.Module">
          <edc:ModuleMacro edc:replace="@" edc:with="20"/>
          <edc:ModuleMacro edc:replace="%x%" edc:with="SCK1"/>
          <edc:ModuleMacro edc:replace="%y%" edc:with="SDI1"/>
        </edc:Module_ref>
        <edc:Module_ref edc:begin="0x0" edc:end="0x2" edc:modsrc="DOS-01017-RPINRx.Module">
          <edc:ModuleMacro edc:replace="@" edc:with="21"/>
          <edc:ModuleMacro edc:replace="%x%" edc:with="RSV"/>
          <edc:ModuleMacro edc:replace="%y%" edc:with="SS1"/>
          <edc:ModuleExclude edc:impl="0x80ff" edc:offset="0x0"/>
        </edc:Module_ref>
        <edc:AdjustPoint edc:offset="2"/>
        <edc:Module_ref edc:begin="0x0" edc:end="0x2" edc:modsrc="DOS-01017-RPINRx.Module">
          <edc:ModuleMacro edc:replace="@" edc:with="23"/>
          <edc:ModuleMacro edc:replace="%x%" edc:with="RSV"/>
          <edc:ModuleMacro edc:replace="%y%" edc:with="SS2"/>
          <edc:ModuleExclude edc:impl="0x80ff" edc:offset="0x0"/>
